<script lang='ts' setup>
useHead({
  title: 'Вопросы и ответы',
})
</script>

<template>
  <section class="container">
    <SectionHeader class="mt-10 mb-15">
      <template #title>
        Вопросы и ответы
      </template>
    </SectionHeader>

    <Collapse>
      <template #title>
        Что будет делать кошка, если облить собаку валерьянкой?
      </template>

      <template #content>
        Яйцо как способ размножения появилось намного раньше кур. Согласно
        современным взглядам, птицы являются эволюционными «потомками»
        динозавров, уже размножавшихся яйцами задолго до начала процесса
        эволюционной трансформации некоторой части динозавров в птиц. В условный
        исторический момент возникновения класса птиц было снесено яйцо, из
        которого позднее вылупилась «птица».
      </template>
    </Collapse>
    <Collapse>
      <template #title>
        Что будет делать кошка, если облить собаку валерьянкой?
      </template>

      <template #content>
        Яйцо как способ размножения появилось намного раньше кур. Согласно
        современным взглядам, птицы являются эволюционными «потомками»
        динозавров, уже размножавшихся яйцами задолго до начала процесса
        эволюционной трансформации некоторой части динозавров в птиц. В условный
        исторический момент возникновения класса птиц было снесено яйцо, из
        которого позднее вылупилась «птица».
      </template>
    </Collapse>
    <Collapse>
      <template #title>
        Что будет делать кошка, если облить собаку валерьянкой?
      </template>

      <template #content>
        Яйцо как способ размножения появилось намного раньше кур. Согласно
        современным взглядам, птицы являются эволюционными «потомками»
        динозавров, уже размножавшихся яйцами задолго до начала процесса
        эволюционной трансформации некоторой части динозавров в птиц. В условный
        исторический момент возникновения класса птиц было снесено яйцо, из
        которого позднее вылупилась «птица».
      </template>
    </Collapse>
    <Collapse>
      <template #title>
        Что будет делать кошка, если облить собаку валерьянкой?
      </template>

      <template #content>
        Яйцо как способ размножения появилось намного раньше кур. Согласно
        современным взглядам, птицы являются эволюционными «потомками»
        динозавров, уже размножавшихся яйцами задолго до начала процесса
        эволюционной трансформации некоторой части динозавров в птиц. В условный
        исторический момент возникновения класса птиц было снесено яйцо, из
        которого позднее вылупилась «птица».
      </template>
    </Collapse>
  </section>
</template>
